app/controllers/songs_controller.rb

  def create
    if params[:song][:artist_name] != ""
      @song = Song.new(song_params(:title, :artist_name))
      if @song.save
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Blur"], ["created_at", "2016-01-27 00:20:14.513159"], ["updated_at", "2016-01-27 00:20:14.513159"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Song 2"], ["artist_id", 1], ["created_at", "2016-01-27 00:20:14.516774"], ["updated_at", "2016-01-27 00:20:14.516774"]]

    def update
      @song = Song.find(params[:id])

      @song.update(song_params(:title, :artist_id, :artist_name))
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "songs" SET "title" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "Mr. Poopside"], ["updated_at", "2016-07-01 02:36:06.793206"], ["id", 1]]